# Список людей
random_humans = ['Князев Роман Семёнович','Гордеев Анатолий Васильевич','Дорофеева Лада Николаевна','Крюков Борис Иванович','Шестаков Игорь Романович','Щукин Олег Вадимович','Терентьев Роман Евгеньевич','Хохлова Елизавета Валерьевна','Артемьева Яна Викторовна','Новиков Антон Романович','Козлова Полина Фёдоровна','Моисеев Алексей Леонидович','Шашков Степан Григориевич','Ширяева Яна Васильевна','Воронова Александра Данииловна','Попов Юрий Даниилович','Воронова Полина Анатольевна','Марков Валентин Матвеевич','Дьячков Антон Эдуардович','Степанова Карина Романовна','Одинцов Егор Геннадьевич','Назаров Игорь Владиславович','Данилов Константин Владиславович','Блохина Оксана Никитовна','Ширяева Валентина Леонидовна','Кудряшова Анастасия Александровна','Силин Георгий Викторович','Дроздова Вероника Юрьевна','Козлов Степан Юрьевич','Дроздов Матвей Станиславович','Кулагина Алла Васильевна','Сорокина Галина Данииловна','Колесникова София Олеговна','Иванов Алексей Вячеславович','Федорова Маргарита Эдуардовна','Архипов Роман Андреевич','Тимофеева Людмила Данииловна','Кузнецова Анастасия Антоновна','Анисимова Валентина Викторовна','Никитин Иван Иванович','Кулагин Георгий Фёдорович','Исаев Григорий Александрович','Михеева Галина Геннадьевна','Сысоев Фёдор Романович','Федорова Лидия Георгиевна','Зуева Алла Романовна','Гущин Георгий Никитович','Титова Лада Евгеньевна','Цветкова Алёна Романовна','Козлова Дарья Кирилловна','Сергеева Юлия Вячеславовна','Петухова Алёна Данииловна','Рыбаков Игорь Егорович','Соколов Иван Дмитриевич','Алексеева София Тимуровна','Савельева Екатерина Вячеславовна','Гущин Вадим Егорович','Новикова Марина Петровна','Гордеев Денис Даниилович','Полякова Вера Романовна','Сидоров Кирилл Кириллович','Третьякова Вера Евгеньевна','Сафонова Мария Васильевна','Блинов Вячеслав Михайлович','Никифоров Никита Степанович','Кузнецов Матвей Валентинович','Кабанов Игорь Эдуардович','Дорофеева Полина Фёдоровна','Соловьев Никита Леонидович','Авдеев Сергей Иванович','Кошелев Александр Владиславович','Давыдова Кира Егоровна','Марков Фёдор Валерьевич','Цветкова Маргарита Романовна','Мясникова Лада Владимировна','Андреев Анатолий Олегович','Ковалева Любовь Юрьевна','Третьякова Наталья Валентиновна','Савин Никита Ильич','Харитонов Михаил Евгеньевич','Брагин Алексей Евгеньевич','Анисимов Никита Николаевич','Шашкова Галина Вадимовна','Некрасов Максим Эдуардович','Крылов Константин Валерьевич','Смирнова Ксения Витальевна','Баранова Алёна Вадимовна','Горбунов Роман Матвеевич','Фролов Егор Никитович','Захарова Юлия Константиновна','Лаврентьева Варвара Семёновна','Панфилова Жанна Михайловна','Молчанова Лидия Вадимовна','Коновалова Жанна Данииловна','Суворов Валерий Борисович','Куликов Константин Дмитриевич','Меркушев Андрей Денисович','Денисова Марина Станиславовна','Меркушева Анна Витальевна',]

# Список учебных предметов
random_lessons_school = ['Русский язык','Математика','Информатика','Физика','История','Иностранный язык','Экономическая теория','Философия','Python','Психология','Физическая культура']

# Список административных позиций
random_admins = ['Декан факультета', 'Куратор группы', 'Заведующий кафедрой', 'Староста группы']

# Список факультетов
data_faculties = [
    'Инженерно-технологический факульет',
    'Факульет естествознания',
    'Факульет педагогики',
    'Факульет психологии',
    'Факульет искусств и социокультурного проектирования',
    'Факульет лингвистики и мировых языков',
    'Факульет филологии и массмедиа',
    'Факульет истории и права',
    'Медицинский факульет'
]



# Структура КГПУ им. К.Э. Циолковского
data_structure_kgpu = {
    'Инженерно-технологический факультет': [
        'Кафедра Инженерных и технологических дисциплин',
        'Кафедра Информатики и информационных технологий',
        'Кафедра Физики и математики',
        'Кафедра Экономики и управления'
    ],
    'Факультет естествознания': [
        'Ботанический сад',
        'Кафедра Биологии и экологии',
        'Кафедра Географии и безопасности жизнедеятельности',
        'Кафедра Химии'
    ],
    'Факультет педагогики': [
        'Кафедра Педагогики',
        'Кафедра Теории и методики дошкольного, начального и специального образования'
    ],
    'Факультет психологии': [
        'Кафедра Общей и социальной психологии',
        'Кафедра Психологии развития и образования'
    ],
    'Факультет искусств и социокультурного проектирования': [
        'Кафедра Искусств и социально-культурной деятельности',
        'Кафедра Социальной адаптации и организации работы с молодежью',
        'Кафедра Теории и методики физического воспитания',
        'Кафедра Физического воспитания',
        'Кафедра Философии, культурологии и социологии'
    ],
    'Факультет лингвистики и мировых языков': [
        'Кафедра Английского языка',
        'Кафедра Лингвистики и иностранных языков',
        'Кафедра Теории языкознания и немецкого языка',
        'Кафедра Французского языка'
    ],
    'Факультет филологии и массмедиа': [
        'Кафедра Литературы',
        'Кафедра Русского языка',
        'Кафедра Русского языка как иностранного'
    ],
    'Факультет истории и права': [
        'Кафедра Истории',
        'Кафедра Таможенного дела и логистики',
        'Кафедра Юриспруденции'
    ],
    'Медицинский факультет': [
        'Кафедра Внутренних болезней',
        'Кафедра Медико-биологических дисциплин',
        'Кафедра Постдипломного образования - Eдиный аккредитационно-симуляционный центр подготовки медицинских работников',
        'Кафедра Хирургии'
    ]
}


# Должности педагогических работников,отнесенных к профессорско-преподавательскому составу
# Aссистент
# Декан факультета
# Начальник факультета
# Директор института
# Начальник института
# Доцент
# Заведующий кафедрой
# Начальник кафедры
# Заместитель начальника кафедры
# Профессор
# Преподаватель
# Старший преподаватель