num = int(input('Введите число: '))
# ИСПРАВИТЬ: лишняя запятая в конце первой строчки
# ИСПОЛЬЗОВАТЬ: длинные литералы удобно записывать на нескольких строчках кода следующим образом:
print(f'Следующее за числом {num} число: {num+1},\n'
      f'Для числа {num} предыдущее число: {num-1}')
# КОММЕНТАРИЙ: в круглых скобках (в том числе и в круглых скобках функций) записаны два строковых литерала, которые при вычислении объединяются в один с помощью неявной конкатенации — вне круглых скобок потребуется явная конкатенация

# Введите число: 20
# Следующее за числом 20 число: 21
# Для числа 20 предыдущее число: 19


# ИТОГ: очень хорошо — 3/3
